10/data/attachments/b50c83cf3618f5a2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7a7d4e4f-fd83-4257-a088-faddf684ca2d</nif:username>
            <nif:friendToBeAdded>Christine_environmental_Friend_83651_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>